modules/Template/Admin/LiveEditorController.php

    public function __construct(Page $page, Template $template)
    {
        $this->page = $page;
---
select * from `core_pages` where `core_pages`.`id` = '4' and `core_pages`.`deleted_at` is null limit 1